{
  "backend/main.mo": "Defines the main actor with access control, user profiles, transaction/expense types, storage maps, and functions to manage profiles, transactions, and expenses.",
  "backend/migration.mo": "Provides a migration module that converts old transaction records to a new format with additional timestamp fields.",
  "feature_evidence.json": "Lists feature evidence entries mapping features to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Contains short summaries of key frontend files including pages, hooks, components, and configuration files.",
  "frontend/index.html": "HTML entry point configuring PWA settings, icons, and service‑worker registration.",
  "frontend/public/manifest.json": "PWA manifest defining app metadata, icons, colors, and launch configuration.",
  "frontend/public/sw.js": "Service worker implementing cache setup, cleanup, and a network‑first fetch strategy with offline fallback.",
  "frontend/src/App.tsx": "Root React app configuring authentication layout, routing, theme provider, and global query client.",
  "frontend/src/components/Footer.tsx": "Simple footer displaying copyright text and a caffeine.ai link.",
  "frontend/src/components/Header.tsx": "Header with branding, navigation menu, and user dropdown showing profile info and logout.",
  "frontend/src/components/InstallPrompt.tsx": "Displays a custom PWA install prompt using the beforeinstallprompt event and stores dismiss state in localStorage.",
  "frontend/src/components/ProfileSetup.tsx": "Shows a modal for new authenticated users to enter and save their name via backend profile APIs.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor based on Internet Identity, reinitializing on identity changes and invalidating dependent queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handling login, logout, stored identity loading, and AuthClient configuration.",
  "frontend/src/hooks/useQueries.ts": "Contains React Query hooks for fetching and mutating user profiles, transactions, reports, and dashboard summaries via the actor.",
  "frontend/src/index.css": "Defines Tailwind layers and custom CSS variables for light/dark themes plus print styling rules.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/DashboardPage.tsx": "Displays dashboard metrics, charts, and greetings using fetched summary and profile data with loading and error states.",
  "frontend/src/pages/KasirPage.tsx": "Implements a cashier interface with cart management, payment validation, and transaction submission using React hooks and backend mutations.",
  "frontend/src/pages/LaporanPage.tsx": "Displays daily and monthly reports with date filtering, formatting helpers, and CSV export/print functionality.",
  "frontend/src/pages/LoginPage.tsx": "Provides an Internet Identity login flow with status handling, error display, and basic app feature info.",
  "frontend/src/pages/PengeluaranPage.tsx": "Handles creation and listing of expenses, including form validation, monthly expense fetching, and formatting utilities.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, persisting, and clearing URL and session parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "TailwindCSS configuration extending theme colors, containers, animations, and enabling typography, container queries, and animate plugins.",
  "project_state.json": "Defines the current project state for Zie’s Kitchen, listing existing features and pending requests related to backdated cashier transactions. Contains metadata for project versioning, issues, and architectural notes."
}